Repository: ArminVanBuuren/CustomApps
Catalog: SPAMessageSaloon/SPAFilter/Properties/Resources.*.resx
Languages: ru

# Form_GridView_DeleteSelected
source: Do you want to delete selected file(s) ?
ru: Вы действительно хотите удалить выбранные файлы?

# Form_PrintXMLFiles_Error
source: Some ({0}) errors found: {1}
ru: Найдены ({0}) ошибки: {1}

# Form_PrintXMLFiles_Successfully
source: Successfully completed.
ru: Успешно завершено.

# Form_GenerateSC_NotFoundAnyOperations
source: No operations found
ru: Операции не найдены

# Form_GenerateSC_NotFileredROBPOps
source: Please filter files
ru: Пожалуйста выполните фильтр

# Form_GridView_IncorrectConfig
source: Configuration application is incorrect or scenario collisions were found. Please check instances with same host types.
ru: Неверная конфигурация или обнаружены коллизии сценариев. Пожалуйста, проверьте инстансы с одинаковыми типами хостов.

# Form_GridView_IsSubScenario
source: Subscenario
ru: Вложенный сценарий

# Form_GridView_NotFoundServiceCatalogCall
source: Business process doesn't have service catalog call
ru: Бизнес процесс не вызывает Сервис Каталог

# Form_GridView_NotFoundSomeCommands
source: Scenario has some commands which don't exist
ru: Сценарий содержит команды которые не существуют

# Form_GridView_NotFoundSomeCommandsInSub
source: Sub-scenario has some commands which don't exist
ru: Вложенный сценарий содержит команды которые не существуют

# Form_GridView_NotFoundSomeOPs
source: Business process has some operations which don't exist
ru: Бизнес процесс содержит операции которые не существуют

# Form_GridView_NotFoundSomeScenarios
source: Scenario for this operation doesn't exist
ru: Сценарий для данной операции не существует

# Form_GridView_NotSelectedAnyRows
source: Please select a row
ru: Пожалуйста выберите строку

# Form_PrintXMLFiles_ToolTip
source: Pretty print all filtered XML files
ru: Этот инструмент преобразует все отфильтрованные XML файлы в удобочитаемый формат

# Form_ToolTip_SearchPattern
source: To search for a specified pattern, you can use % symbol. Example: %Assign%
ru: Для поиска по содержанию, вы можете использовать символ %. Пример: %Assign%

# Form_PrintXMLFiles_Cancel
source: Cancel
ru: Отменить

# Form_PrintXMLFiles_Result
source: {0} out of {1} xml files were printed.
ru: {0} из {1} xml файлов были отформатированы.

# Form_PrintXMLFiles_Question
source: Do you really want to print all {0} xml files?
ru: Вы действительно хотите отформатировать все {0} xml файлы?

# Form_ToolTip_ButtonGenerateSC
source: Generate Service catalog by ROBP operations
ru: Сгенерировать cервис rаталог по ROBP операциям. Прежде чем выполнить, вы должны отфильтровать необходимые ROBP операции или выполнить сброс.

# Form_ToolTip_ExportSCPath
source: Export folder path
ru: Экспорт

# Form_ToolTip_FilterButton
source: Get all matches by filter
ru: Выполнить фильтр

# Form_ToolTip_OpenSCXlsx
source: Excel file path of RD services for fill CFS description. Columns names and orders must be like: '{0}'
ru: Путь к файлу Excel со списком услуг для описания CFS. Имена столбцов и их позиция в документе должна быть: '{0}'

# Form_ToolTip_OpenSevExelButton
source: Get excel file of RD services for fill CFS description. Columns names and orders must be like: '{0}'
ru: Открыть файл Excel со списком услуг для описания CFS. Имена столбцов и их позиция в документе должна быть: '{0}'

# Form_ToolTip_ProcessesButtonOpen
source: Open folder with Business Processes
ru: Открыть директорию с файлами Бизнес процессов

# Form_ToolTip_ROBPOperationButtonOpen
source: Open folder with Operations
ru: Открыть директорию с папками Операций

# Form_ToolTip_RootSCExportPathButton
source: Open export folder path
ru: Открыть директорию для экспорта

# Form_ToolTip_ServiceCatalogOpenButton
source: Open Service catalog file
ru: Открыть файл Сервис каталога

# Form_GridView_XMLFileIsIncorrect
source: Xml file is incorrect!
ru: Некорректный Xml файл!

# Form_GridView_IncorrectROBPOperation
source: Incorrect ROBP operation
ru: Некорректная ROBP операция

# DirectoryNotFound
source: {1} directory: "{0}" not found
ru: Директория '{1}': "{0}" не найдена

# FileNotFound
source: File "{0}" not found
ru: Файл "{0}" не найден

# Filter_ActivatorAlreadyExist
source: Activator "{0}" already exist.
ru: Активатор "{0}" уже существует

# Filter_AddActivator
source: Add activator
ru: Добавление активатора

# Filter_GenerateSCWithoutOperations
source: You can create Service Catalog only with ROBP operations.
ru: Вы можете создать Сервис Каталог только с ROBP операциями

# Filter_InitializeActivatorsWarning
source: When initializing instances:'{0}' - {1} scenario collisions were found! For correct work of a filter, please choose only one instance (host type).
ru: При инициализации инстансов:'{0}' были обнаружены коллизии сценариев. {1} из них дублируются. Для корректной работы фильтра, выберите только один экземпляр (тип хоста).

# Filter_MissingColumn
source: Wrong file '{0}'. Missing some required columns. Columns names should be like: '{1}'
ru: Ошибка при считывании файла '{0}'. Отсутствуют обязательные столбцы. Имена столбцов и их позиция в документе должна быть: '{1}'

# Filter_NotEnabled
source: Filter is not enabled!
ru: Данные фильтра некорректны!

# Filter_NoWorksheetFound
source: No worksheet found
ru: Документ не найден

# Filter_ROBPOperationdDirInvalid
source: You must select a folder with exported ROBP's host type directories.
ru: Вы должны выбрать каталог с типами хостов в которых присутствуют ROBP операции

# Filter_WrongColumnStatement
source: Wrong column name before '{0}' from file '{1}'. Columns names and orders must be like: '{2}'
ru: Некорректный столбец перед '{0}' из файла '{1}'. Имена столбцов и их позиция в документе должна быть: '{2}'

# InvalidXml
source: Xml file "{0}" is invalid
ru: Ошибка при чтении Xml файла "{0}"

# ServiceActivator_ConfigInvalid
source: Activator config "{0}" is incorrect
ru: Ошибка при чтении конфига "{0}"

# ServiceCatalog_AlreadyExist
source: {0} already exist.
ru: {0} уже существует.

# ServiceCatalog_DoubleScenario
source: Service Catalog is invalid. '{0}' already exist.
ru: Ошибка при чтении Сервис каталога. Сценарий '{0}' уже существует

# ServiceCatalog_InvalidScenario
source: Some scenarios are invalid. No attributes found.
ru: Ошибка при чтении сценариев, не найдены атрибуты.

# ServiceCatalog_InvalidXml
source: Xml file "{0}" is invalid
ru: Ошибка при чтении Xml файла "{0}"

# ServiceCatalog_NoHostTypeAttr
source: {0} is invalid. Attribute "hostType" not found.
ru: Некорректный {0}. Не найден атрибут "hostType"

# ServiceCatalog_NoNameAttribute
source: Service Catalog is invalid. {0} doesn't have attribute \"name\" or value is empty.
ru: Ошибка при чтении Сервис каталога. {0} не имеет атрибута "name" или значение пустое.

# ServiceCatalog_NoRFSFound
source: Service Catalog is invalid. No RFS found.
ru: Ошибка при чтении Сервис каталога. Не найдены RFS.

# ServiceCatalog_NotFound
source: Not found {0}
ru: Не найден {0}

# ServiceCatalog_NotFoundScenarioPrefix
source: Service Catalog is invalid. Attribute \"scenarioPrefix\" not found.
ru: Ошибка при чтении Сервис каталога. Не найден атрибут "scenarioPrefix".

# ServiceCatalog_NotFoundTyoeAttribute
source: {0} is invalid. Attribute "type" not found in scenario "{1}"
ru: Ошибка {0}. Не найден атрибут "type" в сценарии "{1}"

# ServiceCatalog_RFSNoAttributes
source: Some RFS are invalid. No attributes found.
ru: Ошибка при чтении RFS. Атрибуты не найдены.

# ServiceCatalog_ScenarioNotFoundRFS
source: Scenario "{0}" is invalid. Not found any RFS.
ru: Ошибка чтения "{0}" сценария. Не найден ни один RFS.

# ServiceCatalog_ScenarioWithDifferentHostType
source: Scenario "{0}" has RFS with different hostTypes - "{1}"
ru: Сценарий "{0}" содержит RFS с разными типами хостов - "{1}"

# ServiceInstance_AttributesPathXmlNotFound
source: Attributes: '@path' | '@xml' not found. Or "dictionary" node not found.
ru: Не найдены атрибуты: '@path' | '@xml'. Или нода с именем "dictionary" не найдена.

# ServiceInstance_AttributesRootNotFound
source: Attribute: '@Root' not found in file dictionary: "{0}"
ru: Не найден атрибут: '@Root' в словаре: "{0}"

# ServiceInstance_DirNotFound
source: Directory: "{0}" not found. Final path: "{1}"
ru: Не найдена директория: "{0}". Конечный путь: "{1}"

# ServiceInstance_DirNotFoundWithDescription
source: Directory: "{0}" not found when initializing file dictionary: "{1}"
ru: Не найдена директория: "{0}" при инициализации словаря: "{1}"

# ServiceInstance_NotFoundHardwareID
source: Attribute: '@hardwareID' not found in serviceInstance
ru: Не найден атрибут: '@hardwareID' в конфигурации serviceInstance

# ServiceInstance_NotFoundScenriosDir
source: Attribute: '@dir' not found in "fileScenarioSource". Or 'scenarios' node not found.
ru: Не найден атрибут: '@dir' в ноде "fileScenarioSource". Или нода с именем 'scenarios' не найдена.

# Form_ExportPath
source: Export Path
ru: Экспорт

# Form_Filter
source: Filter
ru: Фильтр

# Form_OpenXksx
source: Open xlsx
ru: Открыть xlsx

# Form_RDServices
source: RD Services
ru: RD сервисы

# Form_Root
source: Root
ru: Указать

# Form_GenerateSC
source: Generate SC
ru: Создать SC

# Form_AddActivator
source: Add Activator Instances
ru: Добавить файл конфиграции активатора. Будут добавлены все сценарии и команды для каждого инстанса активатора.

# Form_GenerateSC2
source: Generate SC
ru: Создать SC

# Form_Refresh
source: Refresh
ru: Обновить. Все настройки экземпляра с соответствующими сценариями и командами будут перезагружены.

# Form_Reload
source: Reload
ru: Перезагрузить. Все настройки активатора со связанными экземплярами будут перезагружены.

# Form_RemoveInstance
source: Remove instance from the list
ru: Исключить сервис инстанс из списка. Все связанные сценарии и команды будут также исключены.

# Form_Get
source: Filter [F5]
ru: Фильтр F5
