Repository: ArminVanBuuren/CustomApps
Catalog: SPAMassageSaloon/LogsReader/Properties/Resources.*.resx
Languages: ru

# Txt_LRSettingsScheme_LogsDirectory
source: Directories for search. Enabled option allDirSearching="true" performs a search in the top and in all child directories.
ru: Директории для поиска. Включенная опция allDirSearching="true" выполняет поиск в текущем каталоге и во всех дочерних.

# Txt_LRSettingsScheme_MaxThreads
source: Maximum amount of threads. If the value is -1 then amount of threads corresponds to the ammount of processing files.
ru: Максимальное количество потоков. Если установить значение -1, то количество потоков будет соответствовать количеству обрабатываемых файлов.

# Txt_LRSettingsScheme_MaxTraceLines
source: Maximum amount of lines for trace stack. Whole trace must be parsed by the "TraceParse" patterns. Setting affects RAM.
ru: Максимальное количество строк для фрагмента трассировки. Весь фрагмент должен парсится паттернами из "TraceParse". Чем больше значение, тем отводится больше времи на обработку поиска и оказывает влияние на оперативную.

# Txt_LRSettingsScheme_Servers
source: Servers for search. Specify with a comma. The "Priority" attribute sets the order in which the search is performed on servers and file types. The value "0" sets the maximum priority.
ru: Сервера для поиска, указать через запятую. Атрибут "Priority" устанавливает очередность выполнения поиска по серверам и типам файлов. Значение "0" устанавивает максимальный приоритет.

# Txt_LRSettingsScheme_TraceParse
source: Attribute "displayDateFormat" sets the display date format. Attribute "culture" is used with the "displayDateFormat" attribute, default value is empty. "Pattern" nodes are used for parsing and reading trace parameters. It can be used together with the "Custom" setting, and has a higher priority. Selected from top to bottom, from the most accurate to the default. To correctly display the results, RegEx groupings must be used in the attributes. Regular expression works only with options Singleline and CultureInvariant. Timeout execution - 10 seconds. Also in the attributes you can use custom functions from the "CustomFunctions" setting, an example of the format: Date="custom_date_parse ('$ 1')". "Custom" node - added the ability to use custom functions for parsing a trace. It can be used with the “Pattern” settings, and has a lower priority. Each class must implement the ICustomTraceParse interface. The main method - "IsTraceMatch" parses the target trace fragment. The "IsLineMatch" method - is called only when the optional "StartTraceLineWith" or "EndTraceLineWith" parameters are not set and asks for the possibility of adding lines to the previous successfully parsed trace. "TransactionPattern" nodes are optional settings, that are used to search for transactions in the found trace. Slows down the processing speed, but contributes to a more detailed search. Custom functions can be used in node attributes. The "ElapsedSec" field displays the execution time in the bundle of one transaction, the calculation is performed from the first transaction found. "StartTraceLineWith" and "EndTraceLineWith" nodes are optional settings. Improve search speed, because what determines the exact boundary tracing. Parsing is done line by line, and not the entire stack. Options can be used individually, as well as in one setting. Regular expression works only with options Singleline and CultureInvariant. Timeout execution - 10 seconds. "IsError" node is an optional setting for searching the logical result of an error in a found trace. The RegEx works with the Singleline, CultureInvariant, and IgnoreCase options.
ru: Атрибут "displayDateFormat" устанавливает формат отображения даты. Атрибут "culture" используется вместе с атрибутом "displayDateFormat", по умолчанию значение пустое. Атрибут "transactionsMarkingType" устанавливает тип маркировки отображаемых транзакций. Доступные типы - "None", "Both", "Color", "Prompt". Ноды "Pattern" - настройки паттернов для парсинга трейса. Можно использовать вместе с настройкой "Custom", и имеет больший приоритет. Подбираются сверху вниз, от самого точного, до дефолтного. Для корректного отображения результатов, в атрибутах необходимо использовать группировки RegEx. Регулярное выражение работает с опциями Singleline и CultureInvariant. Таймаут выполнения - 10 секунд. Также в атрибутах могут использоваться кастомные функции из настройки "CustomFunctions", пример формата: Date="custom_date_parse('$1')". Нода "Custom" - добавлена возможность использования кастомных функций для парсинга трейса. Может использовать вместе с настройками "Pattern", но имеет меньший приоритет. Каждый класс должен реализовать интерфейс ICustomTraceParse. Основной метод - "IsTraceMatch" выполняет парсинг целевого фрагмента трейса. Метод "IsLineMatch" - вызывается когда опциональные параметры "StartTraceLineWith" или "EndTraceLineWith" не установлены, и запрашивает возможность для дополнения строк к предыдущему успешно спарсенному трейсу. Одна из обязательных настроек "Pattern" или "Custom" (или совместные) должны быть использованы. Ноды "TransactionPattern" - опциональные настройками. Используюстся для поиска транзакций в найденном трейсе. Замедляет скорость обработки, но способствует более детальному поиску. В атрибутах могут использоваться кастомные функции. Поле "ElapsedSec" отображает время выполнения в связке одной транзакции, подсчет выполняется от первой найденной транзакции. Ноды "StartTraceLineWith" и "EndTraceLineWith" - опциональные настройки. Улучшают скорость поиска, т.к. определяются точные границы трассировки. Парсинг выполняется построчно, а не всего стека целиком. Опции можно использовать по отдельности, а также в одной настройке. Регулярное выражение работает с опциями Singleline и CultureInvariant. Таймаут выполнения - 10 секунд. Нода "IsError" - опциональная настройка для поиска в найденном трейсе логический результат ошибки. Регулярное выражение работает с опциями Singleline, CultureInvariant и IgnoreCase.

# Txt_LRSettingsScheme_Types
source: File types, specify with a comma. A search on the content of the file name, extension included. The "Priority" attribute sets the order in which the search is performed on servers and file types. The value "0" sets the maximum priority.
ru: Типы файлов, указать через запятую. Производится поиск по содержанию в имени файла включая расширение. Атрибут "Priority" устанавливает очередность выполнения поиска по серверам и типам файлов. Значение "0" устанавивает максимальный приоритет.

# Txt_LRSettings_Deserialize_Ex
source: Config "{0}" is incorrect! Moved to "{1}". {2}
ru: Ошибка при чтении конфигурационного файла "{0}" ! Перемещен в "{1}". {2}

# Txt_LRSettings_PreviousSearchComment
source: Previous search value
ru: Предыдущее значение поиска

# Txt_LRSettings_Serialize_Ex
source: Unable to save config to path "{0}". {1}
ru: Невозможно сохранить конфигурацию в "{0}". {1}

# Txt_LRSettings_SettingsComment
source: Atributte "encoding" is used when reading log files. Attribute "cultureList" using when trying to parse string Date from trace, dafault value is empty and for trying to parse multiple cultures set value for example "ru-RU;en-US". For disable comments in the config file, you should set "disableHintComments" attribute to true.
ru: Атрибут "encoding" используется при считывании лог файлов. Атрибут "cultureList" используется для парсинга даты из трейса, по умолчанию значение пустое, а для нескольких культур установите значение, например: "ru-RU;en-US". Чтобы отключить комментарии в конфиге, необходимо перевести настройку "disableHintComments" в значение true.

# Txt_Form_DateFilterComment
source: "Date" filter
ru: Фильтр по полю "Date"

# Txt_Form_TraceNameFilterComment
source: "TraceName" filter to find a matching. Option turns off when value is empty. Several filters have to be listed with a comma. Case is ignored.
ru: Фильтр по полю "TraceName". Опция отключается если значение пустое. Несколько фильтров необходимо указать через запятую. Регистр не учитывается.

# Txt_Form_TraceFilterComment
source: "Trace" filter to find a matching. Option turns off when value is empty. Several filters have to be listed with a comma. Case is ignored.
ru: Фильтр по полю "Trace". Опция отключается если значение пустое. Несколько фильтров необходимо указать через запятую. Регистр не учитывается.

# Txt_Form_AlreadyUseFilterComment
source: Search with filter
ru: Применить фильтр во время поиска

# Txt_LRSettingsScheme_OrderBy
source: Allowed sorting by fields: "ID", "Server", "TraceName", "Date", "ElapsedSec", "File", "Priority", "FoundLineID". "FoundLineID" is the line number in the file by found trace, is indicated with Description. With a comma you can sort the fields, and you can also use the "desc" function. "Priority" is what was set when sorting the search order of files.
ru: Допустима сортировка по полям: "ID", "Server", "TraceName", "Date", "ElapsedSec", "File", "Priority", "FoundLineID". "FoundLineID" - номер строки в файле по найденному фрагменту, указывается вместе с Description. Через запятую можно указать несколько полей сортировки, а также использовать операцию desc. "Priority" - то что было установлено при сортировке порядка поиска файлов.

# Txt_LRSettingsScheme_RowsLimit
source: The limit on the count of lines. Setting affects RAM.
ru: Ограничение по количеству строк. Оказывает влияние на оперативную память.

# Txt_Form_SearchComment
source: Use options of invariant culture and ignoring the case. When Regex option of search is used timeout of completing is 1 second.
ru: Регистр не учитывается. При использовании поиска по Regex - таймаут выполнения 1 секунда.

# Txt_Form_trvMainComment
source: Options must be selected to perform the search. By mouse right click you can add group(s) of servers, file types, and directories to search.
ru: Для выполнения поиска, должны быть выбраны опции. Щелкнув правой кнопкой мыши, вы можете добавить группы серверов, группы из типов файлов и директории для поиска.

# Txt_DataFilter_ErrDate
source: Date of end must be greater than date of start
ru: Фильтр по дате окончания должен быть больше даты начала

# Txt_DataTemplate_ErrTimeout
source: Timeout while executing pattern: "{0}". Timeout: {1} Input data: {2}
ru: Таймаут выполнения паттерна: "{0}". Таймаут: {1} Входные данные: {2}

# Txt_LogsReaderForm_Contains
source: Contains
ru: Содержит

# Txt_LogsReaderForm_FilesCompleted_1
source: Files completed:
ru: Обработано файлов:

# Txt_LogsReaderForm_FilesCompleted_2
source: of
ru: из

# Txt_LogsReaderForm_NotContains
source: Not Contains
ru: Не содержит

# Txt_LRSettingsScheme_ErrOrderBy
source: OrderBy item - '{0}' is incorrect! Please check.
ru: Поле OrderBy - '{0}' - некорректно!

# Txt_LRSettingsScheme_ErrMandatory
source: Error loading schema '{0}'. Check the settings for 'TraceParse\@Pattern' or 'TraceParse\@Custom'.
ru: Ошибка загрузки схемы '{0}'. Проверьте корректность настроек 'TraceParse\@Pattern' или 'TraceParse\@Custom'.

# Txt_LRSettingsScheme_ErrUnique
source: Columns must be unique!
ru: Столбцы должны быть уникальными!

# Txt_LRSettings_ErrDeserialize
source: Deserialize Error
ru: Ошибка при чтении конфигурационного файла

# Txt_LRSettings_ErrSerialize
source: Serialize Error
ru: Ошибка при попытке сохранить конфигурацию

# Txt_LRSettings_ErrUnique
source: Schemes names must be unique!
ru: Имена схем должны быть уникальными!

# Txt_LRTraceParse_ErrPattern
source: Pattern "{0}" is incorrect!
ru: Некорректный паттерн "{0}" !

# Txt_Main_ErrLoadScheme
source: Failed to load schema "{0}" {1}
ru: Ошибка при загрузке схемы "{0}" {1}

# Txt_Main_LoadScheme
source: Load scheme
ru: Загрузка схемы

# Txt_Initialization
source: Initialization
ru: Инициализация

# Txt_LogsReaderForm_Clear
source: Clear [F6]
ru: Очистить [F6]

# Txt_LogsReaderForm_DateValueIsIncorrect
source: Date value is incorrect
ru: Некорректное значение даты

# Txt_LogsReaderForm_DoesntMatchByPattern
source: Doesn't match by "TraceParse" patterns
ru: Невозможно спарсить по паттернам "TraceParse"

# Txt_LogsReaderForm_ErrExport
source: Unable to save file "{0}". {1}
ru: Невозможно сохранить файл "{0}". {1}

# Txt_LogsReaderForm_Exporting
source: Exporting...
ru: Экспорт...

# Txt_LogsReaderForm_Filter
source: Filter [F7]
ru: Фильтр [F7]

# Txt_LogsReaderForm_FinishedIn
source: Finished in {0}
ru: Завершено. Время выполнения: {0}

# Txt_LogsReaderForm_NoFilterResultsFound
source: No filter results found
ru: Фильтр не дал результатов

# Txt_LogsReaderForm_NoLogsFound
source: No logs found
ru: Логи не найдены

# Txt_LogsReaderForm_Reset
source: Reset [F8]
ru: Сброс [F8]

# Txt_LogsReaderForm_Search
source: Search [F5]
ru: Поиск [F5]

# Txt_LogsReaderForm_Stop
source: Stop [Esc]
ru: Стоп [Esc]

# Txt_LogsReaderForm_Stopping
source: Stopping...
ru: Остановка...

# Txt_LogsReaderForm_SuccessExport
source: Successfully exported to file "{0}"
ru: Успешно экспортировано в "{0}"

# Txt_LogsReaderForm_Types
source: Types
ru: Типы

# Txt_LogsReaderForm_UseFilterWhenSearching
source: Use filter when searching
ru: Применить с поиском

# Txt_LogsReaderForm_UseRegex
source: Use Regex
ru: По Regex

# Txt_LogsReaderForm_Working
source: Working...{0}
ru: Поиск...{0}

# Txt_LogsReaderPerformer_IncorrectSearchPattern
source: Pattern "{0}" is incorrect for use as regular expression! Please check.
ru: Паттерн "{0}" для поиска по регулярному выражению - некорректный!

# Txt_LogsReaderPerformer_NoFilesLogsFound
source: No files logs found
ru: Лог файлы не найдены

# Txt_LogsReaderPerformer_SessionAlreadyCompleted
source: Current session is already completed!
ru: Текущая сессия уже завершена!

# Txt_LogsReaderPerformer_SessionStopped
source: Session was stopped
ru: Сессия остановлена

# Txt_LogsReaderForm_Servers
source: Servers
ru: Сервера

# Txt_LogsReaderForm_ExportComment
source: Export found or filtered data to csv file
ru: Экспорт результата поиска или фильтра в csv файл [Ctrl+S]

# Txt_LogsReaderForm_Description
source: This is a universal application for searching and parsing applications logs, as well as convenient viewing.
ru: Это универсальное приложение для поиска и считывания лог файлов, а также для удобного просмотра.

# Txt_LogsReaderForm_AddFileType
source: Add file type [Ctrl+T]
ru: Добавить тип файла [Ctrl+T]

# Txt_LogsReaderForm_AddFileTypeGroup
source: Add file type group [Ctrl+H]
ru: Добавить группу из типов файлов [Ctrl+H]

# Txt_LogsReaderForm_AddFolder
source: Add search folder [Ctrl+J]
ru: Добавить директорию для поиска [Ctrl+J]

# Txt_LogsReaderForm_AddServer
source: Add server [Ctrl+R]
ru: Добавить сервер [Ctrl+R]

# Txt_LogsReaderForm_AddServerGroup
source: Add server group [Ctrl+G]
ru: Добавить группу из серверов [Ctrl+G]

# Txt_LogsReaderForm_LogsFolder
source: Folders
ru: Директории

# Txt_LogsReaderForm_Properties
source: Properties [Ctrl+P]
ru: Свойства [Ctrl+P]

# Txt_FileTypesGroups_ErrUnique
source: Group names of file types must be unique!
ru: Имена групп типов должны быть уникальными!

# Txt_Folders_ErrUnique
source: Folders path must be unique!
ru: Пути к каталогам должны быть уникальными!

# Txt_Forms_Add
source: Add
ru: Добавить

# Txt_Forms_AddFolder
source: Add Folder
ru: Добавить директорию

# Txt_Forms_AddFolderTooltip
source: Search will be carried out in the top and all child directories.
ru: Поиск будет осуществляться в текущем каталоге и во всех дочерних.

# Txt_Forms_AddGroup
source: Add Group
ru: Добавить группу

# Txt_Forms_AllDirectories
source: All directories
ru: Все директории

# Txt_Forms_Cancel
source: Cancel
ru: Отмена

# Txt_Forms_FileTypesGroup
source: File Types Group
ru: Группа файловых типов

# Txt_Forms_Folder
source: Folder
ru: Папка

# Txt_Forms_Group
source: Group
ru: Группа

# Txt_Forms_GroupName
source: Group Name
ru: Имя группы

# Txt_Forms_Remove
source: Remove
ru: Удалить

# Txt_Forms_RemoveAll
source: Remove All
ru: Удалить все

# Txt_Forms_Server
source: Server
ru: Сервер

# Txt_Forms_ServerGroup
source: Server Group
ru: Группа серверов

# Txt_LogsReaderForm_RemoveSelected
source: Remove selected [Del]
ru: Удалить выбранное [Del]

# Txt_ServerGroups_ErrUnique
source: Server group names must be unique!
ru: Имена групп серверов должны быть уникальными!

# Txt_LogsReaderForm_AccessDenied
source: Access to the server '{0}' is denied. Failed to reach the target path '{1}'.
ru: Нет доступа к серверу '{0}'. Невозможно получить доступ к директории '{1}'.

# Txt_LogsReaderForm_LogFilesSearching
source: Log files searching...
ru: Поиск лог файлов...

# Txt_LogsReaderPerformer_FilesNotInitialized
source: Target files not found
ru: Лог файлы не найдены

# Txt_LRSettings_CustomFunctionsComment
source: Enumeration of custom functions. Used to adjust the displayed data, if this cannot be done by RegEx grouping. Applicable only in the attributes nodes - Pattern and TransactionPattern. Each class must implement the ICustomFunction interface which has only one function "Invoke". Format: "{custom_function_test('arg1', 'arg2', 'arg3', '$1 - test','$2')}"
ru: Набор кастомных функций, позволяет регулировать отображение результатов поиска, если это невозможно сделать при помощи группировки регулярных выражений. Можно использовать только в атрибутах нод - "Pattern" и "TransactionPattern". Каждых класс должен реализовать интерфейс ICustomFunction который имеет всего одну функцию "Invoke". Количество входных аргументов - неограниченно. Формат: "{custom_function_test('arg1', 'arg2', 'arg3', '$1 - test','$2')}"

# Txt_LRSettings_UseRegexComment
source: Regex search is being completed faster.
ru: Поиск по регулярному выражению выполняется быстрее.

# Txt_Global_Back
source: Back
ru: Фон

# Txt_Global_Fore
source: Fore
ru: Текст

# Txt_Global_SelectAll
source: Select All
ru: Выбрать Все

# Txt_Global_Info
source: Allows you to perform a search on several schemes at once. All results are uploaded to the "Global" tab, and the results will be displayed in their own schemes. When you search again in certain schemes, the results will also be applied in the "Global" tab, if the scheme was originally selected. When you change the general search settings or filter fields in the "Global" tab - all changes will be made in all of the selected schemes. Colors schemes are adjustable.
ru: Позволяет выполнить поиск сразу по нескольким схемам. Все результаты выгружаются во вкладке "Global", а также результаты будут отображаться в собственных схемах. При повторном поиске в определенных схемах, результаты также будут применяться во вкладке "Global", если схема была изначально выбрана. При изменении общих полей поиска или фильтра во вкладке "Global" - все изменения будут вноситься во всех выбранных схемах. Цвета схем регулируются.

# Txt_LogsReaderForm_SearchPatternIsNull
source: Please enter a search term
ru: Пожалуйста введите критерий поиска

# Txt_LRSettingsScheme_ErrNode
source: Scheme="{0}" has incorrect node "{1}". Please check.
ru: Схема "{0}" имеет некорректные настройки ноды "{1}".

# Txt_LRSettingsScheme_ErrSchemeName
source: The attribute '@name' of schemas must not be empty.
ru: Аттрибут '@name' для всех схем логирования должен быть заполнен.

# Txt_LogsReaderForm_NextErrButt
source: Next error [F3]
ru: Следующая ошибка [F3]

# Txt_LogsReaderForm_PrevErrButt
source: Previous error [SHIFT+F3]
ru: Предыдущая ошибка [SHIFT+F3]

# Txt_Close
source: Close
ru: Закрыть

# Txt_CloseAllButThis
source: Close All But This
ru: Закрыть все, кроме этой

# Txt_CloseAllDocuments
source: Close All Documents
ru: Закрыть все документы

# Txt_Forms_GroupPriority
source: Priority
ru: Приоритет

# Txt_Forms_ShowTransactions
source: Shows information about transactions and elapsed execution time
ru: Показывает информацию о транзакциях и затраченном времени выполнения

# Txt_LogsReaderForm_ColorBack
source: Color background
ru: Цвет фона

# Txt_LogsReaderForm_ColorFore
source: Coloe foreground
ru: Цвет текста

# Txt_LogsReaderForm_HighlightTxt
source: Execute filter and highlight [F1]
ru: Выполнить фильтр с маркировкой [F1]

# Txt_LogsReaderForm_HighlightTxtOff
source: Reset highlights [F2]
ru: Сбросить маркировку [SHIFT + F1]
